# pandas
used for basically data analysis such as data manipulation, data visualisation, building ML models
Panas Data Structures are..........Series(works as numpy array), Data Frame
Pandas is basically build on top of numpy array

# Pandas Series

In [43]:
import pandas as pd

In [44]:
#series() function works just like the np.array()
a = pd.Series([1,2,3,4,5])

In [45]:
a

0    1
1    2
2    3
3    4
4    5
dtype: int64

Here the 1st column represents as index & the 2nd column represents the value

In [46]:
#If we want to check the type of "a"
type(a)

pandas.core.series.Series

In [47]:
a[2]

3

In [48]:
a = pd.Series(['a','b','c'])

In [49]:
a

0    a
1    b
2    c
dtype: object

N.B: In Series() function if we store there string then it represent as 'OBJECT'

In [50]:
#If we want the date list 
a = pd.date_range(start = '01-01-2020', end = '07-05-2020')

In [51]:
a

DatetimeIndex(['2020-01-01', '2020-01-02', '2020-01-03', '2020-01-04',
               '2020-01-05', '2020-01-06', '2020-01-07', '2020-01-08',
               '2020-01-09', '2020-01-10',
               ...
               '2020-06-26', '2020-06-27', '2020-06-28', '2020-06-29',
               '2020-06-30', '2020-07-01', '2020-07-02', '2020-07-03',
               '2020-07-04', '2020-07-05'],
              dtype='datetime64[ns]', length=187, freq='D')

In [52]:
type(a)

pandas.core.indexes.datetimes.DatetimeIndex

# Pandas DataFrame

In [53]:
import numpy as np

In [54]:
temp = np.random.randint(low = 20, high = 100, size = [20,]) #That means 20 to 100 random values of 20 size
name = np.random.choice(['Faysal', 'Borshon', 'Nadia', 'Nodi'], 20) #That means these names are coming randomly 20 times
value = np.random.choice(['75','77','2','100'], 20)

Now we will zip all the variables to a list for making the DataFrame properly

In [55]:
#Data Frame with list
a = list(zip(temp, name, value))

In [56]:
df = pd.DataFrame(data = a, columns = ['Temp', 'Name', 'Value'])

In [57]:
df

    Temp     Name Value
0     90  Borshon     2
1     94  Borshon     2
2     42  Borshon     2
3     56   Faysal   100
4     27   Faysal    75
5     28    Nadia   100
6     49  Borshon    75
7     58   Faysal    77
8     76  Borshon    77
9     56   Faysal    77
10    35     Nodi     2
11    41    Nadia    77
12    82  Borshon    75
13    54  Borshon    75
14    92   Faysal     2
15    37     Nodi    77
16    78    Nadia     2
17    27   Faysal    75
18    56    Nadia     2
19    30   Faysal    77

In [58]:
type(df)

pandas.core.frame.DataFrame

In [59]:
#Data Frame with dictionary
df = pd.DataFrame({'temp':temp, 'Name':name, 'value':value})

In [60]:
df

    temp     Name value
0     90  Borshon     2
1     94  Borshon     2
2     42  Borshon     2
3     56   Faysal   100
4     27   Faysal    75
5     28    Nadia   100
6     49  Borshon    75
7     58   Faysal    77
8     76  Borshon    77
9     56   Faysal    77
10    35     Nodi     2
11    41    Nadia    77
12    82  Borshon    75
13    54  Borshon    75
14    92   Faysal     2
15    37     Nodi    77
16    78    Nadia     2
17    27   Faysal    75
18    56    Nadia     2
19    30   Faysal    77

In [61]:
#for initial 5 values
df.head()

   temp     Name value
0    90  Borshon     2
1    94  Borshon     2
2    42  Borshon     2
3    56   Faysal   100
4    27   Faysal    75

In [62]:
#For last 5 values
df.tail()

    temp    Name value
15    37    Nodi    77
16    78   Nadia     2
17    27  Faysal    75
18    56   Nadia     2
19    30  Faysal    77

In [63]:
#Dimension of Data Frame
df.shape

(20, 3)

In [64]:
df.columns

Index(['temp', 'Name', 'value'], dtype='object')

In [65]:
df.Name

0     Borshon
1     Borshon
2     Borshon
3      Faysal
4      Faysal
5       Nadia
6     Borshon
7      Faysal
8     Borshon
9      Faysal
10       Nodi
11      Nadia
12    Borshon
13    Borshon
14     Faysal
15       Nodi
16      Nadia
17     Faysal
18      Nadia
19     Faysal
Name: Name, dtype: object

In [66]:
#Another way to show column and most used way
df['Name']

0     Borshon
1     Borshon
2     Borshon
3      Faysal
4      Faysal
5       Nadia
6     Borshon
7      Faysal
8     Borshon
9      Faysal
10       Nodi
11      Nadia
12    Borshon
13    Borshon
14     Faysal
15       Nodi
16      Nadia
17     Faysal
18      Nadia
19     Faysal
Name: Name, dtype: object

In [67]:
#This will return all the statistics of temp column
df['temp'].describe()

count    20.000000
mean     55.400000
std      22.792889
min      27.000000
25%      36.500000
50%      55.000000
75%      76.500000
max      94.000000
Name: temp, dtype: float64

In [68]:
#To know all the information of Data Frame
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   temp    20 non-null     int32
 1   Name    20 non-null     object
 2   value   20 non-null     object
dtypes: int32(1), object(2)
memory usage: 528.0+ bytes

In [69]:
df.values

array([[90, 'Borshon', '2'],
       [94, 'Borshon', '2'],
       [42, 'Borshon', '2'],
       [56, 'Faysal', '100'],
       [27, 'Faysal', '75'],
       [28, 'Nadia', '100'],
       [49, 'Borshon', '75'],
       [58, 'Faysal', '77'],
       [76, 'Borshon', '77'],
       [56, 'Faysal', '77'],
       [35, 'Nodi', '2'],
       [41, 'Nadia', '77'],
       [82, 'Borshon', '75'],
       [54, 'Borshon', '75'],
       [92, 'Faysal', '2'],
       [37, 'Nodi', '77'],
       [78, 'Nadia', '2'],
       [27, 'Faysal', '75'],
       [56, 'Nadia', '2'],
       [30, 'Faysal', '77']], dtype=object)

In [70]:
#Make any particular column to index
df.set_index('temp')

         Name value
temp
90    Borshon     2
94    Borshon     2
42    Borshon     2
56     Faysal   100
27     Faysal    75
28      Nadia   100
49    Borshon    75
58     Faysal    77
76    Borshon    77
56     Faysal    77
35       Nodi     2
41      Nadia    77
82    Borshon    75
54    Borshon    75
92     Faysal     2
37       Nodi    77
78      Nadia     2
27     Faysal    75
56      Nadia     2
30     Faysal    77

In [71]:
df

    temp     Name value
0     90  Borshon     2
1     94  Borshon     2
2     42  Borshon     2
3     56   Faysal   100
4     27   Faysal    75
5     28    Nadia   100
6     49  Borshon    75
7     58   Faysal    77
8     76  Borshon    77
9     56   Faysal    77
10    35     Nodi     2
11    41    Nadia    77
12    82  Borshon    75
13    54  Borshon    75
14    92   Faysal     2
15    37     Nodi    77
16    78    Nadia     2
17    27   Faysal    75
18    56    Nadia     2
19    30   Faysal    77

In [72]:
#For making the change permanently 

df.set_index('temp', inplace = True)

#inplace is by default False to make it permanently change I have to change inplace in True

In [73]:
df

         Name value
temp
90    Borshon     2
94    Borshon     2
42    Borshon     2
56     Faysal   100
27     Faysal    75
28      Nadia   100
49    Borshon    75
58     Faysal    77
76    Borshon    77
56     Faysal    77
35       Nodi     2
41      Nadia    77
82    Borshon    75
54    Borshon    75
92     Faysal     2
37       Nodi    77
78      Nadia     2
27     Faysal    75
56      Nadia     2
30     Faysal    77

In [74]:
#Sorting the temp index in descending order
df.sort_index(axis = 0, ascending = False)

         Name value
temp
94    Borshon     2
92     Faysal     2
90    Borshon     2
82    Borshon    75
78      Nadia     2
76    Borshon    77
58     Faysal    77
56     Faysal   100
56      Nadia     2
56     Faysal    77
54    Borshon    75
49    Borshon    75
42    Borshon     2
41      Nadia    77
37       Nodi    77
35       Nodi     2
30     Faysal    77
28      Nadia   100
27     Faysal    75
27     Faysal    75

In [75]:
#For dropping any particular column
df.drop(['value'], axis = 1)

#Value is sitting by default in a column not in a row. For dropping the value column I need to change the axis in 1 as it is by default axis = 0

         Name
temp
90    Borshon
94    Borshon
42    Borshon
56     Faysal
27     Faysal
28      Nadia
49    Borshon
58     Faysal
76    Borshon
56     Faysal
35       Nodi
41      Nadia
82    Borshon
54    Borshon
92     Faysal
37       Nodi
78      Nadia
27     Faysal
56      Nadia
30     Faysal

# Loc & iLOc

In [76]:
#0th & 1st index value of DF
df.iloc[[0,1]]

         Name value
temp
90    Borshon     2
94    Borshon     2

In [77]:
#1st index to 3rd index and 1st column values
df.iloc[1:3, 1]

temp
94    2
42    2
Name: value, dtype: object

In [81]:
df

         Name value
temp
90    Borshon     2
94    Borshon     2
42    Borshon     2
56     Faysal   100
27     Faysal    75
28      Nadia   100
49    Borshon    75
58     Faysal    77
76    Borshon    77
56     Faysal    77
35       Nodi     2
41      Nadia    77
82    Borshon    75
54    Borshon    75
92     Faysal     2
37       Nodi    77
78      Nadia     2
27     Faysal    75
56      Nadia     2
30     Faysal    77

In [91]:
#Playing with boolean
df.iloc[[True, True,False,True,True, True,False,True,True,False,True,True, True,False,True,True, False,True,True,False]]

         Name value
temp
90    Borshon     2
94    Borshon     2
56     Faysal   100
27     Faysal    75
28      Nadia   100
58     Faysal    77
76    Borshon    77
35       Nodi     2
41      Nadia    77
82    Borshon    75
92     Faysal     2
37       Nodi    77
27     Faysal    75
56      Nadia     2

In [93]:
#Value of 0th row and all the colun values
df.iloc[0,:]

Name     Borshon
value          2
Name: 90, dtype: object

In [96]:
#loc means value of the indexes
df.loc[90, :]

Name     Borshon
value          2
Name: 90, dtype: object

In [100]:
#Multiple indexes
df.loc[[90,94,56]]

         Name value
temp
90    Borshon     2
94    Borshon     2
56     Faysal   100
56     Faysal    77
56      Nadia     2

In [102]:
#Values of particular row and all the columns
df.loc[[90,94], :]

         Name value
temp
90    Borshon     2
94    Borshon     2

In [103]:
#Values of particular row and column range
df.loc[[90, 94], 'Name':'value']

         Name value
temp
90    Borshon     2
94    Borshon     2

In [115]:
#Playing with boolean
df.loc[[True, True,False,True,True, True,False,True,True,False,True,True, True,False,True,True, False,True,True,False]]

         Name value
temp
90    Borshon     2
94    Borshon     2
42    Borshon     2
56     Faysal   100
27     Faysal    75
28      Nadia   100
49    Borshon    75
58     Faysal    77
76    Borshon    77
56     Faysal    77
35       Nodi     2
41      Nadia    77
82    Borshon    75
54    Borshon    75
92     Faysal     2
37       Nodi    77
78      Nadia     2
27     Faysal    75
56      Nadia     2
30     Faysal    77

In [125]:
#Convert a series into integer
df['value'] = df.value.astype(int)

In [124]:
df.loc[df.value > 50]

         Name  value
temp
56     Faysal    100
27     Faysal     75
28      Nadia    100
49    Borshon     75
58     Faysal     77
76    Borshon     77
56     Faysal     77
41      Nadia     77
82    Borshon     75
54    Borshon     75
37       Nodi     77
27     Faysal     75
30     Faysal     77

In [126]:
#We can also use condition and logic
df.loc[(df.value > 50) | (df.value == 50)]

         Name  value
temp
56     Faysal    100
27     Faysal     75
28      Nadia    100
49    Borshon     75
58     Faysal     77
76    Borshon     77
56     Faysal     77
41      Nadia     77
82    Borshon     75
54    Borshon     75
37       Nodi     77
27     Faysal     75
30     Faysal     77